<DIV yne-bulb-block="paragraph">&nbsp;<SPAN>&#21313;&#20108;.&#22823;&#25968;&#25454;</SPAN></DIV>
<DIV yne-bulb-block="paragraph"><SPAN>1.&#29305;&#28857;&#65306; </SPAN><SPAN>Volume</SPAN><SPAN>&#65306;&#25968;&#25454;&#37327;&#22823;&#65292;</SPAN><SPAN>Variety</SPAN><SPAN>&#65306;&#25968;&#25454;&#31181;&#31867;&#32321;&#22810;&#65292;</SPAN><SPAN>Value</SPAN><SPAN>&#65306;&#25968;&#25454;&#20215;&#20540;&#23494;&#24230;&#20302;&#65292;</SPAN><SPAN>Velocity&#65306;&#22788;&#29702;&#36895;&#24230;&#24555;</SPAN></DIV>
<DIV yne-bulb-block="paragraph"><SPAN>2.&#25216;&#26415;&#65306;&#22823;&#25968;&#25454;&#37319;&#38598;&#12289;&#22823;&#25968;&#25454;&#39044;&#22788;&#29702;&#12289;&#22823;&#25968;&#25454;&#23384;&#20648;&#21450;&#31649;&#29702;&#12289;&#22823;&#25968; &#25454;&#20998;&#26512;&#21450;&#25366;&#25496;&#12289;&#22823;&#25968;&#25454;&#23637;&#29616;&#21644;&#24212;&#29992;(&#22823;&#25968;&#25454;&#26816;&#32034;&#12289;&#22823;&#25968;&#25454;&#21487;&#35270;&#21270;&#12289;&#22823;&#25968;&#25454;&#24212;&#29992;&#12289;&#22823;&#25968;&#25454;&#23433;&#20840; )&#12290;</SPAN></DIV>
<DIV yne-bulb-block="paragraph"></DIV>
<DIV yne-bulb-block="paragraph"></DIV>
<DIV yne-bulb-block="paragraph"><SPAN>1)</SPAN><SPAN>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; </SPAN><SPAN>&#25991;&#20214;&#31995;&#32479;&#20855;&#26377;&#20197;&#19979;&#29305;&#28857;&#65306;&#8226;&#38024;&#23545;&#29305;&#23450;&#24212;&#29992;&#31995;&#32479;&#35774;&#35745;&#65292;&#38590;&#24230;&#36739;&#23567;&#65307;</SPAN><SPAN> </SPAN><SPAN>&#8226;&#25968;&#25454;&#20887;&#20313;&#36739;&#22823;&#65292;&#21487;&#33021;&#22312;&#22810;&#20010;&#25991;&#20214;&#20013;&#22797;&#21046;&#30456;&#21516;&#30340;&#25968;&#25454;&#23646;&#24615;&#65307;</SPAN><SPAN> </SPAN><SPAN>&#8226;&#20197;&#24212;&#29992;&#31995;&#32479;&#20026;&#20013;&#24515;&#32452;&#32455;&#12289;&#31649;&#29702;&#25968;&#25454;&#65307;&#8226;&#31526;&#21512;&#29305;&#23450;&#24212;&#29992;&#31995;&#32479;&#35201;&#27714;&#30340;&#25991;&#20214;&#25968;&#25454;&#24456;&#38590;&#22312;&#19981;&#21516;&#30340;&#24212;&#29992;&#31995;&#32479;&#20043;&#38388;&#20849;&#20139;&#12290;</SPAN></DIV>
<DIV yne-bulb-block="paragraph"><SPAN>2)</SPAN><SPAN>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; </SPAN><SPAN>&#20851;&#31995;&#22411;&#25968;&#25454;&#24211;&#20855;&#26377;&#20197;&#19979;&#29305;&#28857;&#12290;</SPAN><SPAN> </SPAN><SPAN>&#8226;&#25968;&#25454;&#32467;&#26500;&#38656;&#35201;&#31526;&#21512;&#20851;&#31995;&#27169;&#24335;&#65292;&#35774;&#35745;&#38590;&#24230;&#36739;&#22823;&#65307;&#8226;&#36981;&#23432;&#25968;&#25454;&#24211;&#33539;&#24335;&#65292;&#25968;&#25454;&#20887;&#20313;&#36739;&#23569;&#65307;</SPAN><SPAN> </SPAN><SPAN>&#8226;&#20197;&#25968;&#25454;&#24211;&#20026;&#20013;&#24515;&#32452;&#32455;&#12289;&#31649;&#29702;&#25968;&#25454;&#65307;</SPAN><SPAN> </SPAN><SPAN>&#8226;&#25968;&#25454;&#29420;&#31435;&#20110;&#24212;&#29992;&#31995;&#32479;&#65292;&#24456;&#23481;&#26131;&#22312;&#19981;&#21516;&#30340;&#24212;&#29992;&#31995;&#32479;&#20043;&#38388;&#20849;&#20139;&#25968;&#25454;&#12290;</SPAN></DIV>
<DIV yne-bulb-block="paragraph"><SPAN>3)</SPAN><SPAN>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; </SPAN><SPAN>&#20869;&#23384;&#25968;&#25454;&#24211;&#22411;&#25968;&#25454;&#24211;&#26159;&#23558;&#25968;&#25454;&#25918;&#22312;&#20869;&#23384;&#20013;&#30452;&#25509;&#25805;&#20316;&#30340;&#25968;&#25454;&#24211;&#65292;&#20351;&#29992;&#20869;&#23384;&#22411;&#25968;&#25454;&#24211;&#23558;&#26497;&#22823;&#22320;&#25552;&#39640;&#24212;&#29992;&#30340;&#24615;&#33021;&#65292;&#21516;&#26102;&#36890;&#36807;&#25968;&#25454;&#32531;&#23384;&#12289;&#24555;&#36895;&#31639;&#27861;&#12289;&#24182;&#34892;&#25805;&#20316;&#31561;&#30340;&#25913;&#36827;&#65292;&#20351;&#20869;&#23384;&#22411;&#25968;&#25454;&#24211;&#30456;&#23545;&#20110;&#20256;&#32479;&#30340;&#20851;&#31995;&#22411;&#25968;&#25454;&#24211;&#25968;&#25454;&#22788;&#29702;&#24615;&#33021;&#25552;&#39640;</SPAN><SPAN>10</SPAN><SPAN>&#20493;&#20197;&#19978;&#65292;&#21516;&#26102;&#20869;&#23384;&#22411;&#25968;&#25454;&#24211;&#30340;&#24212;&#29992;&#21463;&#21040;&#20869;&#23384;&#22823;&#23567;&#65292;&#25968;&#25454;&#24674;&#22797;&#35201;&#27714;&#30340;&#38480;&#21046;&#12290;</SPAN></DIV>
<DIV yne-bulb-block="paragraph"><SPAN>4)</SPAN><SPAN>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</SPAN></DIV>
<DIV yne-bulb-block="image"><img alt=0 src="https://note.youdao.com/yws/public/resource/fcb5dfefd40b99bca2595eb2b357caf8/xmlnote/WEBce971fa187ee11cbd3eea56c0523e778/DF4632AC0B964BAEA8CA78D0ACF8E8E4/6240" data-media-type="image"> </DIV>
<DIV yne-bulb-block="paragraph"><SPAN>5)</SPAN><SPAN>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; </SPAN><SPAN>SQL</SPAN><SPAN>&#35821;&#21477;&#35774;&#35745;&#26102;&#65292;&#24433;&#21709;&#26597;&#35810;&#25928;&#29575;&#30340;&#35774;&#35745;&#21407;&#21017;&#26159;&#65306;</SPAN><SPAN> </SPAN><SPAN>&#8226;&#26597;&#35810;&#26102;&#23613;&#37327;&#19981;&#35201;&#36820;&#22238;&#19981;&#38656;&#35201;&#30340;&#34892;&#12289;&#21015;&#65307;&#8226;&#38656;&#35201;&#36827;&#34892;&#22810;&#34920;&#36830;&#25509;&#26619;&#35810;&#26102;&#65292;&#23613;&#37327;&#20351;&#29992;&#36830;&#25509;&#26597;&#35810;&#65292;&#36991;&#20813;&#20351;&#29992;&#23376;&#26597;&#35810;&#32467;&#26500;&#65307;</SPAN><SPAN> </SPAN><SPAN>&#8226;&#23613;&#37327;&#36991;&#20813;&#37319;&#29992;</SPAN><SPAN>NOTIN</SPAN><SPAN>&#12289;</SPAN><SPAN>NOTEXIST</SPAN><SPAN>&#12289;</SPAN><SPAN>LIKE</SPAN><SPAN>&#31561;&#20351;&#29992;&#20840;&#34920;&#26597;&#35810;&#30340;&#25805;&#20316;&#65307;&#8226;&#23613;&#37327;&#36991;&#20813;&#20351;&#29992;</SPAN><SPAN>DISTINCT</SPAN><SPAN>&#20851;&#38190;&#23383;&#12290;</SPAN></DIV>
<DIV yne-bulb-block="paragraph"></DIV>
<DIV yne-bulb-block="paragraph"><SPAN>1</SPAN><SPAN>.&#20998;&#24067;&#24335;&#25968;&#25454;&#24211;&#31995;&#32479;&#19982;&#24182;&#34892;&#25968;&#25454;&#24211;&#31995;&#32479;&#30340;&#21306;&#21035; </SPAN></DIV>
<DIV yne-bulb-block="paragraph"><SPAN>&#20998;&#24067;&#24335;&#25968;&#25454;&#24211;&#31995;&#32479;&#19982;&#24182;&#34892;&#25968;&#25454;&#24211;&#31995;&#32479;&#20855;&#26377;&#24456;&#22810;&#30456;&#20284;&#28857;:&#23427;&#20204;&#37117;&#26159;&#36890;&#36807;&#32593;&#32476;&#36830;&#25509;&#21508;&#20010;&#25968;&#25454;</SPAN></DIV>
<DIV yne-bulb-block="paragraph"><SPAN>&#22788;&#29702;&#32467;&#28857;&#30340;&#65292;&#25972;&#20010;&#32593;&#32476;&#20013;&#30340;&#25152;&#26377;&#32467;&#28857;&#26500;&#25104;&#19968;&#20010;&#36923;&#36753;&#19978;&#32479;&#19968;&#30340;&#25972;&#20307;&#65292;&#29992;&#25143;&#21487;&#20197;&#23545;&#21508;&#20010;&#32467;&#28857;&#19978;&#30340; &#25968;&#25454;&#36827;&#34892;&#36879;&#26126;&#23384;&#21462;&#31561;&#12290;&#20294;&#20998;&#24067;&#24335;&#25968;&#25454;&#24211;&#31995;&#32479;&#19982;&#24182;&#34892;&#25968;&#25454;&#24211;&#31995;&#32479;&#20043;&#38388;&#36824;&#26159;&#23384;&#22312;&#30528;&#26174;&#33879;&#30340;&#21306;&#21035;&#30340;&#65292; &#20027;&#35201;&#34920;&#29616;&#22312;&#20197;&#19979;&#20960;&#20010;&#26041;&#38754;:</SPAN></DIV>
<DIV yne-bulb-block="paragraph"><SPAN>(</SPAN><SPAN>1</SPAN><SPAN>)&#24212;&#29992;&#30446;&#26631;&#19981;&#21516;&#12290;&#24182;&#34892;&#25968;&#25454;&#24211;&#31995;&#32479;&#30340;&#30446;&#26631;&#26159;&#20805;&#20998;&#21457;&#25381;&#24182;&#34892;&#35745;&#31639;&#26426;&#30340;&#20248;&#21183;&#65292;&#21033;&#29992;&#31995;&#32479; &#20013;&#30340;&#21508;&#20010;&#22788;&#29702;&#26426;&#32467;&#28857;&#24182;&#34892;&#22320;&#23436;&#25104;&#25968;&#25454;&#24211;&#20219;&#21153;&#65292;&#25552;&#39640;&#25968;&#25454;&#24211;&#30340;&#25972;&#20307;&#24615;&#33021;&#12290;&#20998;&#24067;&#24335;&#25968;&#25454;&#24211;&#31995;&#32479;&#20027; &#35201;&#30446;&#30340;&#22312;&#20110;&#23454;&#29616;&#21508;&#20010;&#22330;&#22320;&#33258;&#27835;&#21644;&#25968;&#25454;&#30340;&#20840;&#23616;&#36879;&#26126;&#20849;&#20139;&#65292;&#32780;&#19981;&#35201;&#27714;&#21033;&#29992;&#32593;&#32476;&#20013;&#30340;&#21508;&#20010;&#32467;&#28857;&#26469;&#25552; &#39640;&#31995;&#32479;&#30340;&#25972;&#20307;&#24615;&#33021;&#12290;</SPAN></DIV>
<DIV yne-bulb-block="paragraph"><SPAN>(</SPAN><SPAN>2</SPAN><SPAN>)&#23454;&#29616;&#26041;&#24335;&#19981;&#21516;&#12290;&#30001;&#20110;&#24212;&#29992;&#30446;&#26631;&#21508;&#19981;&#30456;&#21516;&#65292;&#22312;&#20855;&#20307;&#23454;&#29616;&#26041;&#27861;&#19978;&#65292;&#24182;&#34892;&#25968;&#25454;&#24211;&#19982;&#20998;&#24067; &#24335;&#25968;&#25454;&#24211;&#20043;&#38388;&#20063;&#26377;&#30528;&#36739;&#22823;&#30340;&#21306;&#21035;&#12290;&#22312;&#24182;&#34892;&#25968;&#25454;&#24211;&#20013;&#65292;&#20026;&#20102;&#20805;&#20998;&#21457;&#25381;&#21508;&#20010;&#32467;&#28857;&#30340;&#22788;&#29702;&#33021;&#21147;&#65292;&#21508; &#32467;&#28857;&#38388;&#37319;&#29992;&#39640;&#36895;&#36890;&#20449;&#32593;&#32476;&#20114;&#32852;&#65292;&#32467;&#28857;&#38388;&#25968;&#25454;&#20256;&#36755;&#20195;&#20215;&#30456;&#23545;&#36739;&#20302;&#12290;&#24403;&#36127;&#36733;&#19981;&#22343;&#34913;&#26102;&#65292;&#21487;&#20197;&#23558;&#24037; &#20316;&#36127;&#36733;&#36807;&#22823;&#30340;&#32467;&#28857;&#19978;&#30340;&#20219;&#21153;&#36890;&#36807;&#39640;&#36895;&#36890;&#20449;&#32593;&#32476;&#36865;&#32473;&#31354;&#38386;&#32467;&#28857;&#22788;&#29702;&#65292;&#20174;&#32780;&#23454;&#29616;&#36127;&#36733;&#24179;&#34913;&#12290;&#22312;&#20998; &#24067;&#24335;&#25968;&#25454;&#24211;&#31995;&#32479;&#20013;&#65292;&#21508;&#32467;&#28857;(&#22330;&#22320;)&#38388;&#19968;&#33324;&#36890;&#36807;&#23616;&#22495;&#32593;&#25110;&#24191;&#22495;&#32593;&#20114;&#32852;&#65292;&#32593;&#32476;&#24102;&#23485;&#27604;&#36739;&#20302;&#65292;&#21508; &#22330;&#22320;&#20043;&#38388;&#30340;&#36890;&#20449;&#24320;&#38144;&#36739;&#22823;&#65292;&#22240;&#27492;&#22312;&#26597;&#35810;&#22788;&#29702;&#26102;&#19968;&#33324;&#24212;&#23613;&#37327;&#20943;&#23569;&#32467;&#28857;&#38388;&#30340;&#25968;&#25454;&#20256;&#36755;&#37327;&#12290;</SPAN></DIV>
<DIV yne-bulb-block="paragraph"><SPAN>(</SPAN><SPAN>3</SPAN><SPAN>)&#21508;&#32467;&#28857;&#30340;&#22320;&#20301;&#19981;&#21516;&#12290;&#22312;&#24182;&#34892;&#25968;&#25454;&#24211;&#20013;&#65292;&#21508;&#32467;&#28857;&#20043;&#38388;&#19981;&#23384;&#22312;&#20840;&#23616;&#24212;&#29992;&#21644;&#23616;&#37096;&#24212;&#29992;&#30340; &#27010;&#24565;&#12290;&#21508;&#20010;&#32467;&#28857;&#21327;&#21516;&#20316;&#29992;&#65292;&#20849;&#21516;&#22788;&#29702;&#65292;&#32780;&#19981;&#21487;&#33021;&#26377;&#23616;&#37096;&#24212;&#29992;&#12290;</SPAN></DIV>