<DIV yne-bulb-block="paragraph"><SPAN>&#19968;.&#25968;&#25454;&#24211;&#31649;&#29702;&#31995;&#32479;</SPAN></DIV>
<DIV yne-bulb-block="paragraph"><SPAN>1.&#20998;&#31867;&#65306;</SPAN><SPAN>&#20851;&#31995;&#22411; </SPAN><SPAN>DBMS</SPAN><SPAN>&#12289;&#25991;&#26723;&#22411; </SPAN><SPAN>DBMS</SPAN><SPAN>&#12289;&#38190;&#20540;&#22411; </SPAN><SPAN>DBMS</SPAN><SPAN>&#12289;&#23545;&#35937;&#22411; </SPAN><SPAN>DBMS</SPAN></DIV>
<DIV yne-bulb-block="paragraph"><SPAN>2.&#19977;&#32423;&#25277;&#35937;&#65306;</SPAN><SPAN>&#29992;&#25143;&#32423;&#12289;&#27010;&#24565;&#32423;&#12289;&#29289;&#29702;&#32423;</SPAN></DIV>
<DIV yne-bulb-block="paragraph"><SPAN>3.&#19977;&#32423;&#27169;&#24335;&#65306;</SPAN><SPAN>&#22806;&#27169;&#24335;&#12289;&#27010;&#24565;&#27169;&#24335;&#12289;&#20869;&#27169;&#24335;</SPAN></DIV>
<DIV yne-bulb-block="paragraph"><SPAN>4.&#20004;&#32423;&#29420;&#31435;&#24615;&#65306;&#25351;&#29289;&#29702;&#29420;&#31435;&#24615;&#21644;&#36923;&#36753;&#29420;&#31435;&#24615;</SPAN></DIV>
<DIV yne-bulb-block="paragraph"><SPAN></SPAN>&nbsp;</DIV>
<DIV yne-bulb-block="paragraph"></DIV>
<DIV yne-bulb-block="paragraph"><SPAN>&#20108;.&#25968;&#25454;&#27169;&#22411;</SPAN></DIV>
<DIV yne-bulb-block="paragraph"><SPAN>1.&#25968;&#25454;&#27169;&#22411;&#20998;&#20026;&#27010;&#24565;&#25968;&#25454;&#27169;&#22411;(&#23454;&#20307;&#32852;&#31995;&#27169;&#22411;)&#21644;&#22522;&#26412;&#25968;&#25454;&#27169;&#22411;(&#32467;&#26500;&#25968;&#25454;&#27169;&#22411;)</SPAN></DIV>
<DIV yne-bulb-block="paragraph"><SPAN>2.&#27010;&#24565;&#25968;&#25454;&#27169;&#22411;&#26159;&#25353;&#29031;&#29992;&#25143;&#30340;&#35266;&#28857;&#26469;&#23545;&#25968;&#25454;&#21644;&#20449;&#24687;&#24314;&#27169;&#65292;&#20027;&#35201;&#29992;&#20110;&#25968;&#25454;&#24211;&#35774;&#35745;</SPAN></DIV>
<DIV yne-bulb-block="paragraph"><SPAN>3.&#22522;&#26412;&#25968;&#25454;&#27169;&#22411;&#26159;&#25353;&#29031;&#35745;&#31639;&#26426;&#31995;&#32479;&#30340;&#35266;&#28857;&#26469;&#23545;&#25968;&#25454;&#21644;&#20449;&#24687;&#24314;&#27169;&#65292;&#20027;&#35201;&#29992;&#20110; </SPAN><SPAN>DBMS </SPAN><SPAN>&#30340;&#23454;&#29616;</SPAN></DIV>
<DIV yne-bulb-block="paragraph"><SPAN>4.&#22522;&#26412;&#25968;&#25454;&#27169;&#22411;&#36890;&#24120;&#30001;&#25968;&#25454;&#32467;&#26500;&#12289;&#25968;&#25454;&#25805;&#20316;&#21644;&#23436;&#25972; &#24615;&#32422;&#26463;&#19977;&#37096;&#20998;&#32452;&#25104;</SPAN></DIV>
<DIV yne-bulb-block="paragraph"><SPAN>5.&#22522;&#26412;&#25968;&#25454;&#27169;&#22411;&#20998;&#20026;&#23618;&#27425;&#27169;&#22411;&#12289;&#32593;&#29366;&#27169;&#22411;&#12289;&#20851;&#31995;&#27169;&#22411;&#21644;&#38754;&#21521;&#23545;&#35937;&#27169;&#22411;</SPAN></DIV>
<DIV yne-bulb-block="paragraph"><SPAN></SPAN>&nbsp;</DIV>
<DIV yne-bulb-block="paragraph"></DIV>
<DIV yne-bulb-block="paragraph"><SPAN>&#19977;.&#20851;&#31995;&#20195;&#25968;</SPAN></DIV>
<DIV yne-bulb-block="paragraph"><SPAN>1.&#22522;&#26412;&#36816;&#31639;&#65306;&#24182;&#12289;&#20132;&#12289;&#24046;&#12289;&#31515;&#21345;&#23572;&#31215;&#12289;&#36873;&#25321;&#12289;&#25237;&#24433;&#12289;&#36830;&#25509;&#21644;&#38500;&#27861;&#36816;&#31639;&#12290;</SPAN></DIV>
<DIV yne-bulb-block="paragraph"><SPAN></SPAN>&nbsp;</DIV>
<DIV yne-bulb-block="paragraph"></DIV>
<DIV yne-bulb-block="paragraph"><SPAN>&#22235;.&#33539;&#24335;</SPAN></DIV>
<DIV yne-bulb-block="paragraph"><SPAN>1.</SPAN><SPAN>1NF </SPAN><SPAN>&#26159;&#26368;&#20302;&#30340;&#35268;&#33539;&#21270;&#35201;&#27714;&#12290;&#22914;&#26524;&#20851;&#31995; </SPAN><SPAN>R </SPAN><SPAN>&#20013;&#25152;&#26377;&#23646;&#24615;&#30340;&#20540;&#22495;&#37117;&#26159;&#31616;&#21333;&#22495;&#65292;&#20854;&#20803;&#32032;(&#21363;&#23646;&#24615;)&#19981;&#21487;&#20877;&#20998;&#65292;&#26159;&#23646;&#24615;&#39033;&#32780;&#19981;&#26159;&#23646;&#24615;&#32452;&#65292;&#37027;&#20040;&#20851;&#31995;&#27169;&#22411; </SPAN><SPAN>R </SPAN><SPAN>&#26159;&#31532;&#19968;&#33539;&#24335;&#30340;&#65292;&#35760;&#20316; </SPAN><SPAN>RI&#770;1NF</SPAN><SPAN>&#12290;</SPAN></DIV>
<DIV yne-bulb-block="paragraph"><SPAN>2.&#22914;&#26524;&#19968;&#20010;&#20851;&#31995; </SPAN><SPAN>R </SPAN><SPAN>&#23646;&#20110; </SPAN><SPAN>1NF</SPAN><SPAN>&#65292;&#19988;&#25152;&#26377;&#30340;&#38750;&#20027;&#23646;&#24615;&#37117;&#23436;&#20840;&#20381;&#36182;&#20110;&#20027;&#23646;&#24615;&#65292;&#35760;&#20316; </SPAN><SPAN>RI&#770;2NF</SPAN></DIV>
<DIV yne-bulb-block="paragraph"><SPAN>3.&#22914;&#26524;&#19968;&#20010;&#20851;&#31995; </SPAN><SPAN>R </SPAN><SPAN>&#23646;&#20110; </SPAN><SPAN>2NF</SPAN><SPAN>&#65292;</SPAN><SPAN>&#30830;&#20445;&#25968;&#25454;&#34920;&#20013;&#30340;&#27599;&#19968;&#21015;&#25968;&#25454;&#37117;&#21644;&#20027;&#38190;&#30452;&#25509;&#30456;&#20851;</SPAN><SPAN>&#65292;</SPAN><SPAN>&#22312;2NF&#22522;&#30784;&#19978;&#28040;&#38500;&#20256;&#36882;&#20381;&#36182;</SPAN></DIV>
<DIV yne-bulb-block="paragraph"><SPAN></SPAN>&nbsp;</DIV>
<DIV yne-bulb-block="paragraph"></DIV>
<DIV yne-bulb-block="paragraph"><SPAN>&#20116;.&#21453;&#35268;&#33539;&#21270;</SPAN></DIV>
<DIV yne-bulb-block="paragraph"><SPAN>1.&#22686;&#21152;&#20887;&#20313;&#21015;&#65306;&#25351;&#22312;&#22810;&#20010;&#34920;&#20013;&#20855;&#26377;&#30456;&#21516;&#30340;&#21015;&#65292;&#23427;&#24120;&#29992;&#26469;&#22312;&#26597;&#35810;&#26102;&#36991;&#20813;&#36830;&#25509;&#25805;&#20316;</SPAN></DIV>
<DIV yne-bulb-block="paragraph"><SPAN>2.&#22686;&#21152;&#27966;&#29983;&#21015;&#65306;&#25351;&#22686;&#21152;&#30340;&#21015;&#21487;&#20197;&#36890;&#36807;&#34920;&#20013;&#20854;&#20182;&#25968;&#25454;&#35745;&#31639;&#29983;&#25104;</SPAN></DIV>
<DIV yne-bulb-block="paragraph"><SPAN>3.&#37325;&#26032;&#32452;&#34920;&#65306;&#22914;&#26524;&#35768;&#22810;&#29992;&#25143;&#38656;&#35201;&#26597;&#30475;&#20004;&#20010;&#34920;&#36830;&#25509;&#20986;&#26469;&#30340;&#32467;&#26524;&#25968;&#25454;&#65292;&#21017;&#25226;&#36825;&#20004;&#20010;&#34920;&#37325;&#26032;&#32452;&#25104; &#19968;&#20010;&#34920;&#26469;&#20943;&#23569;&#36830;&#25509;&#32780;&#25552;&#39640;&#24615;&#33021;</SPAN></DIV>
<DIV yne-bulb-block="paragraph"><SPAN>4.&#20998;&#21106;&#34920;&#65306;&#26377;&#26102;&#23545;&#34920;&#20570;&#20998;&#21106;&#21487;&#20197;&#25552;&#39640;&#24615;&#33021;&#12290;&#34920;&#20998;&#21106;&#26377;&#20004;&#31181;&#26041;&#24335;&#65306;&#27700;&#24179;&#20998;&#21106;&#21644;&#22402;&#30452;&#20998;&#21106;</SPAN></DIV>
<DIV yne-bulb-block="paragraph"><SPAN></SPAN>&nbsp;</DIV>
<DIV yne-bulb-block="paragraph"><SPAN>&#20845;.&#25968;&#25454;&#24211;&#35774;&#27493;&#39588;</SPAN></DIV>
<DIV yne-bulb-block="paragraph"><SPAN>1.&#38656;&#27714;&#20998;&#26512;&#65306;&#35843;&#26597;&#30740;&#31350;&#65292;&#20102;&#35299;&#29992;&#25143;&#30340;&#25968;&#25454;&#35201;&#27714;&#21644;&#22788;&#29702;&#35201;&#27714;&#65292;&#24182;&#25353;&#19968;&#23450;&#26684;&#24335;&#25972;&#29702;&#38656;&#27714;&#35828;&#26126;&#20070;</SPAN><SPAN>&#65292;&#23436;&#25104;&#30340;&#25991;&#26723;&#25968;&#25454;&#23383;&#20856;&#21644;&#25968;&#25454;&#27969;&#22270;</SPAN></DIV>
<DIV yne-bulb-block="paragraph"><SPAN>2.&#27010;&#24565;&#32467;&#26500;&#35774;&#35745;&#65306;E-R&#27169;&#22411;&#65292;&#25552;&#20379;&#33021;&#22815;&#35782;&#21035;&#21644;&#29702;&#35299;&#31995;&#32479;&#35201;&#27714;&#30340;&#26694;&#26550;;&#20026;&#25968;&#25454;&#24211;&#25552;&#20379;&#19968;&#20010;&#35828;&#26126;&#24615;&#32467;&#26500;&#65292;&#20316;&#20026;&#35774;&#35745;&#25968;&#25454;&#24211;&#36923;&#36753;&#32467;&#26500;&#65292;&#21363;&#36923;&#36753;&#27169;&#22411;&#30340;&#22522;&#30784;</SPAN></DIV>
<DIV yne-bulb-block="paragraph"><SPAN>3.&#36923;&#36753;&#32467;&#26500;&#35774;&#35745;&#65306;&#23601;&#26159;&#25226;&#27010;&#24565;&#32467;&#26500;&#35774;&#35745;&#38454;&#27573;&#35774;&#35745;&#22909;&#30340;&#22522;&#26412; </SPAN><SPAN>E-R </SPAN><SPAN>&#22270;&#36716;&#25442;&#20026;&#19982;&#20855; &#20307;&#26426;&#22120;&#19978;&#30340; </SPAN><SPAN>DBMS </SPAN><SPAN>&#20135;&#21697;&#25152;&#25903;&#25345;&#30340;&#25968;&#25454;&#27169;&#22411;&#30456;&#31526;&#21512;&#30340;&#36923;&#36753;&#32467;&#26500;</SPAN></DIV>
<DIV yne-bulb-block="paragraph"><SPAN>4.&#25968;&#25454;&#24211;&#29289;&#29702;&#35774;&#35745;&#65306;&#23454;&#38469;&#30340;&#29289;&#29702;&#35774;&#22791;&#19978;&#30340;&#23384;&#20648;&#32467;&#26500;&#21644;&#23384;&#21462;&#26041;&#27861;&#31216;&#20026;&#25968;&#25454;&#24211;&#30340;&#29289;&#29702;&#32467;&#26500;</SPAN></DIV>
<DIV yne-bulb-block="paragraph"><SPAN></SPAN>&nbsp;</DIV>
<DIV yne-bulb-block="paragraph"></DIV>
<DIV yne-bulb-block="paragraph"><SPAN>&#19971;.&#20107;&#21153;&#31649;&#29702;</SPAN></DIV>
<DIV yne-bulb-block="paragraph"><SPAN>1.&#29305;&#24615;&#65306;&#21407;&#23376;&#24615;&#12289;&#19968;&#33268;&#24615;&#12289;&#38548;&#31163;&#24615;&#12289;&#25345;&#32493;&#24615;</SPAN></DIV>
<DIV yne-bulb-block="paragraph"><SPAN>2.&#24182;&#21457;&#25511;&#21046;</SPAN></DIV>
<DIV yne-bulb-block="paragraph"><SPAN>&#20004;&#27573;&#38145;&#21327;&#35758;&#65306;&#25193;&#23637;&#38454;&#27573;&#33719;&#21462;&#23553;&#38145;&#65292;&#25910;&#32553;&#38454;&#27573;&#37322;&#25918;&#38145;&#65292;&#21487;&#20018;&#34892;&#21270;&#21644;&#21457;&#29983;&#27515;&#38145;&#12290;</SPAN></DIV>
<DIV yne-bulb-block="paragraph"><SPAN>3.&#25925;&#38556;&#19982;&#24674;&#22797;</SPAN></DIV>
<DIV yne-bulb-block="paragraph"><SPAN>&#20998;&#31867;&#65306;&#20107;&#21153;&#25925;&#38556;&#12289;&#31995;&#32479;&#25925;&#38556;&#12289;&#20171;&#36136;&#25925;&#38556;&#12289;&#35745;&#31639;&#26426;&#30149;&#27602;</SPAN></DIV>
<DIV yne-bulb-block="paragraph"><SPAN></SPAN>&nbsp;</DIV>
<DIV yne-bulb-block="paragraph"></DIV>
<DIV yne-bulb-block="paragraph"><SPAN>&#20843;.&#20998;&#24067;&#24335;&#25968;&#25454;&#24211;&#31995;&#32479;</SPAN></DIV>
<DIV yne-bulb-block="paragraph"><SPAN>1.</SPAN><SPAN>&#20998;&#29255;&#36879;&#26126;&#26159;&#25351;&#29992;&#25143;&#25110;&#24212;&#29992;&#31243;&#24207;&#19981;&#38656;&#35201;&#30693;&#36947;&#36923;&#36753;&#19978;&#35775;&#38382;&#30340;&#34920;&#20855;&#20307;&#26159;&#24590;&#20040;&#20998;&#22359;&#23384;&#20648;&#30340;&#12290;</SPAN></DIV>
<DIV yne-bulb-block="paragraph"><SPAN>&#22797;&#21046;&#36879;&#26126;&#26159;&#25351;&#37319;&#29992;&#22797;&#21046;&#25216;&#26415;&#30340;&#20998;&#24067;&#26041;&#27861;&#65292;&#29992;&#25143;&#19981;&#38656;&#35201;&#30693;&#36947;&#25968;&#25454;&#26159;&#22797;&#21046;&#21040;&#21738;&#20123;&#33410;&#28857;&#65292;&#22914;&#20309;&#22797;&#21046;&#30340;&#20301;&#32622;&#36879;&#26126;&#26159;&#25351;&#29992;&#25143;&#26080;&#39035;&#30693;&#36947;&#25968;&#25454;&#23384;&#25918;&#30340;&#29289;&#29702;&#20301;&#32622;</SPAN></DIV>
<DIV yne-bulb-block="paragraph"><SPAN>&#36923;&#36753;&#36879;&#26126;&#65292;&#21363;&#23616;&#37096;&#25968;&#25454;&#27169;&#22411;&#36879;&#26126;&#65292;&#26159;&#25351;&#29992;&#25143;&#25110;&#24212;&#29992;&#31243;&#24207;&#26080;&#39035;&#30693;&#36947;&#23616;&#37096;&#22330;&#22320;&#20351;&#29992;&#30340;&#26159;&#21738;&#31181;&#25968;&#25454;&#27169;&#22411;&#12290;</SPAN></DIV>
<DIV yne-bulb-block="paragraph"><SPAN>2.&#26550;&#26500;</SPAN></DIV>
<DIV yne-bulb-block="paragraph"><SPAN>(</SPAN><SPAN>1</SPAN><SPAN>)&#20840;&#23616;&#22806;&#27169;&#24335;&#12290;&#23427;&#20204;&#26159;&#20840;&#23616;&#24212;&#29992;&#30340;&#29992;&#25143;&#35270;&#22270;&#65292;&#26159;&#20840;&#23616;&#27010;&#24565;&#27169;&#24335;&#30340;&#23376;&#38598;&#12290;</SPAN></DIV>
<DIV yne-bulb-block="paragraph"><SPAN></SPAN>&nbsp;</DIV>
<DIV yne-bulb-block="paragraph"></DIV>
<DIV yne-bulb-block="paragraph"><SPAN>&#20061;,&#25968;&#20179;</SPAN></DIV>
<DIV yne-bulb-block="paragraph"><SPAN>1.&#27010;&#24565;&#65306;&#19968;&#20010;&#38754;&#21521;&#20027;&#39064;&#30340;&#12289;&#38598;&#25104;&#30340;&#12289;&#30456;&#23545;&#31283;&#23450;&#30340;&#12289;&#19988;&#38543;&#26102;&#38388;&#21464;&#21270;&#30340;&#25968;&#25454;&#38598;&#21512;&#65292;&#29992;&#20110;&#25903;&#25345;&#31649;&#29702;&#20915;&#31574;</SPAN></DIV>
<DIV yne-bulb-block="paragraph"><SPAN>2.&#26694;&#26550;&#32467;&#26500;</SPAN></DIV>
<DIV yne-bulb-block="paragraph"><SPAN>&#25968;&#25454;&#20179;&#24211;&#22522;&#26412;&#21151;&#33021;&#23618;&#12289;&#25968;&#25454;&#20179;&#24211;&#31649;&#29702;&#23618;&#12289;&#25968;&#25454;&#20179;&#24211;&#30340;&#29615;&#22659;&#25903;&#25345;&#23618;</SPAN></DIV>
<DIV yne-bulb-block="paragraph"><SPAN>3.&#26550;&#26500;</SPAN></DIV>
<DIV yne-bulb-block="paragraph"><SPAN>&#25968;&#25454;&#28304;&#12289;&#25968;&#25454;&#30340;&#23384;&#20648;&#19982;&#31649;&#29702;&#12289;</SPAN><SPAN>OLAP </SPAN><SPAN>&#26381;&#21153;&#22120;&#12289;&#21069;&#31471;&#24037;&#20855;</SPAN></DIV>
<DIV yne-bulb-block="paragraph"><SPAN>4.&#23454;&#29616;&#26041;&#27861;</SPAN></DIV>
<DIV yne-bulb-block="paragraph"><SPAN>&#33258;&#39030;&#21521;&#19979;&#27861;&#12289;&#33258;&#24213;&#21521;&#19978;&#27861;&#21644;&#32852;&#21512;&#26041;&#27861;</SPAN></DIV>
<DIV yne-bulb-block="paragraph"><SPAN></SPAN>&nbsp;</DIV>
<DIV yne-bulb-block="paragraph"><SPAN>&#21313;.&#25968;&#25454;&#25366;&#25496;</SPAN></DIV>
<DIV yne-bulb-block="paragraph"><SPAN>1.&#25216;&#26415;&#65306;&#20851;&#32852;&#20998;&#26512;&#12289;&#24207;&#21015;&#20998;&#26512;&#12289;&#20998;&#31867;&#12289;&#39044;&#27979;&#12289;&#32858;&#31867;&#20998;&#26512;&#21450;&#26102;&#38388;&#24207;&#21015;&#20998;&#26512;</SPAN></DIV>
<DIV yne-bulb-block="paragraph"><SPAN>2.&#27969;&#31243;&#65306;&#38382;&#39064;&#23450;&#20041;&#12289;&#24314;&#31435;&#25968;&#25454;&#25366;&#25496;&#24211;&#12289;&#20998;&#26512;&#25968;&#25454;&#12289;&#35843;&#25972;&#25968;&#25454;&#12289;&#27169;&#22411;&#21270;&#12289;&#35780;&#20215;&#21644;&#35299;&#37322;</SPAN></DIV>
<DIV yne-bulb-block="paragraph"><SPAN></SPAN>&nbsp;</DIV>
<DIV yne-bulb-block="paragraph"></DIV>
<DIV yne-bulb-block="paragraph"><SPAN>&#21313;&#19968;.nosql</SPAN></DIV>
<DIV yne-bulb-block="paragraph"><SPAN>1.&#20248;&#20808;&#65306;&#26131;&#25193;&#23637;&#12289;&#22823;&#25968;&#25454;&#37327;&#65292;&#39640;&#24615;&#33021;&#12289;&#28789;&#27963;&#30340;&#25968;&#25454;&#27169;&#22411;&#12289;&#39640;&#21487;&#29992;</SPAN></DIV>
<DIV yne-bulb-block="paragraph"><SPAN></SPAN>&nbsp;</DIV>
<DIV yne-bulb-block="paragraph"><SPAN>&#21313;&#20108;.&#22823;&#25968;&#25454;</SPAN></DIV>
<DIV yne-bulb-block="paragraph"><SPAN>1.&#29305;&#28857;&#65306; </SPAN><SPAN>Volume</SPAN><SPAN>&#65306;&#25968;&#25454;&#37327;&#22823;&#65292;</SPAN><SPAN>Variety</SPAN><SPAN>&#65306;&#25968;&#25454;&#31181;&#31867;&#32321;&#22810;&#65292;</SPAN><SPAN>Value</SPAN><SPAN>&#65306;&#25968;&#25454;&#20215;&#20540;&#23494;&#24230;&#20302;&#65292;</SPAN><SPAN>Velocity&#65306;&#22788;&#29702;&#36895;&#24230;&#24555;</SPAN></DIV>
<DIV yne-bulb-block="paragraph"><SPAN>2.&#25216;&#26415;&#65306;&#22823;&#25968;&#25454;&#37319;&#38598;&#12289;&#22823;&#25968;&#25454;&#39044;&#22788;&#29702;&#12289;&#22823;&#25968;&#25454;&#23384;&#20648;&#21450;&#31649;&#29702;&#12289;&#22823;&#25968; &#25454;&#20998;&#26512;&#21450;&#25366;&#25496;&#12289;&#22823;&#25968;&#25454;&#23637;&#29616;&#21644;&#24212;&#29992;(&#22823;&#25968;&#25454;&#26816;&#32034;&#12289;&#22823;&#25968;&#25454;&#21487;&#35270;&#21270;&#12289;&#22823;&#25968;&#25454;&#24212;&#29992;&#12289;&#22823;&#25968;&#25454;&#23433;&#20840; )&#12290;</SPAN></DIV>
<DIV yne-bulb-block="paragraph"></DIV>
<DIV yne-bulb-block="paragraph"></DIV>
<DIV yne-bulb-block="paragraph"><SPAN>1)</SPAN><SPAN>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; </SPAN><SPAN>&#25991;&#20214;&#31995;&#32479;&#20855;&#26377;&#20197;&#19979;&#29305;&#28857;&#65306;&#8226;&#38024;&#23545;&#29305;&#23450;&#24212;&#29992;&#31995;&#32479;&#35774;&#35745;&#65292;&#38590;&#24230;&#36739;&#23567;&#65307;</SPAN><SPAN> </SPAN><SPAN>&#8226;&#25968;&#25454;&#20887;&#20313;&#36739;&#22823;&#65292;&#21487;&#33021;&#22312;&#22810;&#20010;&#25991;&#20214;&#20013;&#22797;&#21046;&#30456;&#21516;&#30340;&#25968;&#25454;&#23646;&#24615;&#65307;</SPAN><SPAN> </SPAN><SPAN>&#8226;&#20197;&#24212;&#29992;&#31995;&#32479;&#20026;&#20013;&#24515;&#32452;&#32455;&#12289;&#31649;&#29702;&#25968;&#25454;&#65307;&#8226;&#31526;&#21512;&#29305;&#23450;&#24212;&#29992;&#31995;&#32479;&#35201;&#27714;&#30340;&#25991;&#20214;&#25968;&#25454;&#24456;&#38590;&#22312;&#19981;&#21516;&#30340;&#24212;&#29992;&#31995;&#32479;&#20043;&#38388;&#20849;&#20139;&#12290;</SPAN></DIV>
<DIV yne-bulb-block="paragraph"><SPAN>2)</SPAN><SPAN>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; </SPAN><SPAN>&#20851;&#31995;&#22411;&#25968;&#25454;&#24211;&#20855;&#26377;&#20197;&#19979;&#29305;&#28857;&#12290;</SPAN><SPAN> </SPAN><SPAN>&#8226;&#25968;&#25454;&#32467;&#26500;&#38656;&#35201;&#31526;&#21512;&#20851;&#31995;&#27169;&#24335;&#65292;&#35774;&#35745;&#38590;&#24230;&#36739;&#22823;&#65307;&#8226;&#36981;&#23432;&#25968;&#25454;&#24211;&#33539;&#24335;&#65292;&#25968;&#25454;&#20887;&#20313;&#36739;&#23569;&#65307;</SPAN><SPAN> </SPAN><SPAN>&#8226;&#20197;&#25968;&#25454;&#24211;&#20026;&#20013;&#24515;&#32452;&#32455;&#12289;&#31649;&#29702;&#25968;&#25454;&#65307;</SPAN><SPAN> </SPAN><SPAN>&#8226;&#25968;&#25454;&#29420;&#31435;&#20110;&#24212;&#29992;&#31995;&#32479;&#65292;&#24456;&#23481;&#26131;&#22312;&#19981;&#21516;&#30340;&#24212;&#29992;&#31995;&#32479;&#20043;&#38388;&#20849;&#20139;&#25968;&#25454;&#12290;</SPAN></DIV>
<DIV yne-bulb-block="paragraph"><SPAN>3)</SPAN><SPAN>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; </SPAN><SPAN>&#20869;&#23384;&#25968;&#25454;&#24211;&#22411;&#25968;&#25454;&#24211;&#26159;&#23558;&#25968;&#25454;&#25918;&#22312;&#20869;&#23384;&#20013;&#30452;&#25509;&#25805;&#20316;&#30340;&#25968;&#25454;&#24211;&#65292;&#20351;&#29992;&#20869;&#23384;&#22411;&#25968;&#25454;&#24211;&#23558;&#26497;&#22823;&#22320;&#25552;&#39640;&#24212;&#29992;&#30340;&#24615;&#33021;&#65292;&#21516;&#26102;&#36890;&#36807;&#25968;&#25454;&#32531;&#23384;&#12289;&#24555;&#36895;&#31639;&#27861;&#12289;&#24182;&#34892;&#25805;&#20316;&#31561;&#30340;&#25913;&#36827;&#65292;&#20351;&#20869;&#23384;&#22411;&#25968;&#25454;&#24211;&#30456;&#23545;&#20110;&#20256;&#32479;&#30340;&#20851;&#31995;&#22411;&#25968;&#25454;&#24211;&#25968;&#25454;&#22788;&#29702;&#24615;&#33021;&#25552;&#39640;</SPAN><SPAN>10</SPAN><SPAN>&#20493;&#20197;&#19978;&#65292;&#21516;&#26102;&#20869;&#23384;&#22411;&#25968;&#25454;&#24211;&#30340;&#24212;&#29992;&#21463;&#21040;&#20869;&#23384;&#22823;&#23567;&#65292;&#25968;&#25454;&#24674;&#22797;&#35201;&#27714;&#30340;&#38480;&#21046;&#12290;</SPAN></DIV>
<DIV yne-bulb-block="paragraph"><SPAN>4)</SPAN><SPAN>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</SPAN></DIV>
<DIV yne-bulb-block="image"><img alt=0 src="https://note.youdao.com/yws/public/resource/fcb5dfefd40b99bca2595eb2b357caf8/xmlnote/WEBce971fa187ee11cbd3eea56c0523e778/DF4632AC0B964BAEA8CA78D0ACF8E8E4/6240" data-media-type="image"> </DIV>
<DIV yne-bulb-block="paragraph"><SPAN>5)</SPAN><SPAN>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; </SPAN><SPAN>SQL</SPAN><SPAN>&#35821;&#21477;&#35774;&#35745;&#26102;&#65292;&#24433;&#21709;&#26597;&#35810;&#25928;&#29575;&#30340;&#35774;&#35745;&#21407;&#21017;&#26159;&#65306;</SPAN><SPAN> </SPAN><SPAN>&#8226;&#26597;&#35810;&#26102;&#23613;&#37327;&#19981;&#35201;&#36820;&#22238;&#19981;&#38656;&#35201;&#30340;&#34892;&#12289;&#21015;&#65307;&#8226;&#38656;&#35201;&#36827;&#34892;&#22810;&#34920;&#36830;&#25509;&#26619;&#35810;&#26102;&#65292;&#23613;&#37327;&#20351;&#29992;&#36830;&#25509;&#26597;&#35810;&#65292;&#36991;&#20813;&#20351;&#29992;&#23376;&#26597;&#35810;&#32467;&#26500;&#65307;</SPAN><SPAN> </SPAN><SPAN>&#8226;&#23613;&#37327;&#36991;&#20813;&#37319;&#29992;</SPAN><SPAN>NOTIN</SPAN><SPAN>&#12289;</SPAN><SPAN>NOTEXIST</SPAN><SPAN>&#12289;</SPAN><SPAN>LIKE</SPAN><SPAN>&#31561;&#20351;&#29992;&#20840;&#34920;&#26597;&#35810;&#30340;&#25805;&#20316;&#65307;&#8226;&#23613;&#37327;&#36991;&#20813;&#20351;&#29992;</SPAN><SPAN>DISTINCT</SPAN><SPAN>&#20851;&#38190;&#23383;&#12290;</SPAN></DIV>
<DIV yne-bulb-block="paragraph"></DIV>
<DIV yne-bulb-block="paragraph"><SPAN>1</SPAN><SPAN>.&#20998;&#24067;&#24335;&#25968;&#25454;&#24211;&#31995;&#32479;&#19982;&#24182;&#34892;&#25968;&#25454;&#24211;&#31995;&#32479;&#30340;&#21306;&#21035; </SPAN></DIV>
<DIV yne-bulb-block="paragraph"><SPAN>&#20998;&#24067;&#24335;&#25968;&#25454;&#24211;&#31995;&#32479;&#19982;&#24182;&#34892;&#25968;&#25454;&#24211;&#31995;&#32479;&#20855;&#26377;&#24456;&#22810;&#30456;&#20284;&#28857;:&#23427;&#20204;&#37117;&#26159;&#36890;&#36807;&#32593;&#32476;&#36830;&#25509;&#21508;&#20010;&#25968;&#25454;</SPAN></DIV>
<DIV yne-bulb-block="paragraph"><SPAN>&#22788;&#29702;&#32467;&#28857;&#30340;&#65292;&#25972;&#20010;&#32593;&#32476;&#20013;&#30340;&#25152;&#26377;&#32467;&#28857;&#26500;&#25104;&#19968;&#20010;&#36923;&#36753;&#19978;&#32479;&#19968;&#30340;&#25972;&#20307;&#65292;&#29992;&#25143;&#21487;&#20197;&#23545;&#21508;&#20010;&#32467;&#28857;&#19978;&#30340; &#25968;&#25454;&#36827;&#34892;&#36879;&#26126;&#23384;&#21462;&#31561;&#12290;&#20294;&#20998;&#24067;&#24335;&#25968;&#25454;&#24211;&#31995;&#32479;&#19982;&#24182;&#34892;&#25968;&#25454;&#24211;&#31995;&#32479;&#20043;&#38388;&#36824;&#26159;&#23384;&#22312;&#30528;&#26174;&#33879;&#30340;&#21306;&#21035;&#30340;&#65292; &#20027;&#35201;&#34920;&#29616;&#22312;&#20197;&#19979;&#20960;&#20010;&#26041;&#38754;:</SPAN></DIV>
<DIV yne-bulb-block="paragraph"><SPAN>(</SPAN><SPAN>1</SPAN><SPAN>)&#24212;&#29992;&#30446;&#26631;&#19981;&#21516;&#12290;&#24182;&#34892;&#25968;&#25454;&#24211;&#31995;&#32479;&#30340;&#30446;&#26631;&#26159;&#20805;&#20998;&#21457;&#25381;&#24182;&#34892;&#35745;&#31639;&#26426;&#30340;&#20248;&#21183;&#65292;&#21033;&#29992;&#31995;&#32479; &#20013;&#30340;&#21508;&#20010;&#22788;&#29702;&#26426;&#32467;&#28857;&#24182;&#34892;&#22320;&#23436;&#25104;&#25968;&#25454;&#24211;&#20219;&#21153;&#65292;&#25552;&#39640;&#25968;&#25454;&#24211;&#30340;&#25972;&#20307;&#24615;&#33021;&#12290;&#20998;&#24067;&#24335;&#25968;&#25454;&#24211;&#31995;&#32479;&#20027; &#35201;&#30446;&#30340;&#22312;&#20110;&#23454;&#29616;&#21508;&#20010;&#22330;&#22320;&#33258;&#27835;&#21644;&#25968;&#25454;&#30340;&#20840;&#23616;&#36879;&#26126;&#20849;&#20139;&#65292;&#32780;&#19981;&#35201;&#27714;&#21033;&#29992;&#32593;&#32476;&#20013;&#30340;&#21508;&#20010;&#32467;&#28857;&#26469;&#25552; &#39640;&#31995;&#32479;&#30340;&#25972;&#20307;&#24615;&#33021;&#12290;</SPAN></DIV>
<DIV yne-bulb-block="paragraph"><SPAN>(</SPAN><SPAN>2</SPAN><SPAN>)&#23454;&#29616;&#26041;&#24335;&#19981;&#21516;&#12290;&#30001;&#20110;&#24212;&#29992;&#30446;&#26631;&#21508;&#19981;&#30456;&#21516;&#65292;&#22312;&#20855;&#20307;&#23454;&#29616;&#26041;&#27861;&#19978;&#65292;&#24182;&#34892;&#25968;&#25454;&#24211;&#19982;&#20998;&#24067; &#24335;&#25968;&#25454;&#24211;&#20043;&#38388;&#20063;&#26377;&#30528;&#36739;&#22823;&#30340;&#21306;&#21035;&#12290;&#22312;&#24182;&#34892;&#25968;&#25454;&#24211;&#20013;&#65292;&#20026;&#20102;&#20805;&#20998;&#21457;&#25381;&#21508;&#20010;&#32467;&#28857;&#30340;&#22788;&#29702;&#33021;&#21147;&#65292;&#21508; &#32467;&#28857;&#38388;&#37319;&#29992;&#39640;&#36895;&#36890;&#20449;&#32593;&#32476;&#20114;&#32852;&#65292;&#32467;&#28857;&#38388;&#25968;&#25454;&#20256;&#36755;&#20195;&#20215;&#30456;&#23545;&#36739;&#20302;&#12290;&#24403;&#36127;&#36733;&#19981;&#22343;&#34913;&#26102;&#65292;&#21487;&#20197;&#23558;&#24037; &#20316;&#36127;&#36733;&#36807;&#22823;&#30340;&#32467;&#28857;&#19978;&#30340;&#20219;&#21153;&#36890;&#36807;&#39640;&#36895;&#36890;&#20449;&#32593;&#32476;&#36865;&#32473;&#31354;&#38386;&#32467;&#28857;&#22788;&#29702;&#65292;&#20174;&#32780;&#23454;&#29616;&#36127;&#36733;&#24179;&#34913;&#12290;&#22312;&#20998; &#24067;&#24335;&#25968;&#25454;&#24211;&#31995;&#32479;&#20013;&#65292;&#21508;&#32467;&#28857;(&#22330;&#22320;)&#38388;&#19968;&#33324;&#36890;&#36807;&#23616;&#22495;&#32593;&#25110;&#24191;&#22495;&#32593;&#20114;&#32852;&#65292;&#32593;&#32476;&#24102;&#23485;&#27604;&#36739;&#20302;&#65292;&#21508; &#22330;&#22320;&#20043;&#38388;&#30340;&#36890;&#20449;&#24320;&#38144;&#36739;&#22823;&#65292;&#22240;&#27492;&#22312;&#26597;&#35810;&#22788;&#29702;&#26102;&#19968;&#33324;&#24212;&#23613;&#37327;&#20943;&#23569;&#32467;&#28857;&#38388;&#30340;&#25968;&#25454;&#20256;&#36755;&#37327;&#12290;</SPAN></DIV>
<DIV yne-bulb-block="paragraph"><SPAN>(</SPAN><SPAN>3</SPAN><SPAN>)&#21508;&#32467;&#28857;&#30340;&#22320;&#20301;&#19981;&#21516;&#12290;&#22312;&#24182;&#34892;&#25968;&#25454;&#24211;&#20013;&#65292;&#21508;&#32467;&#28857;&#20043;&#38388;&#19981;&#23384;&#22312;&#20840;&#23616;&#24212;&#29992;&#21644;&#23616;&#37096;&#24212;&#29992;&#30340; &#27010;&#24565;&#12290;&#21508;&#20010;&#32467;&#28857;&#21327;&#21516;&#20316;&#29992;&#65292;&#20849;&#21516;&#22788;&#29702;&#65292;&#32780;&#19981;&#21487;&#33021;&#26377;&#23616;&#37096;&#24212;&#29992;&#12290;</SPAN></DIV>